import numpy as np
import pandas as pd
import os
import sys
import tqdm
from sklearn.model_selection import train_test_split

# sizekorea 8차 볼륨 추가 데이터 불러오기
data = pd.read_excel('data/size_korea_new/size_korea_02_volume.xlsx')
# 일부 컬럼 삭제
data = data[['나이', '측정복_젖_가슴_둘레',
'측정복_배꼽수준_허리_둘레', '키', '몸무게',
'목_둘레', '목밑_둘레', '목밑뒤_길이', '목뒤_등뼈위_겨드랑_수준_길이',
'목옆_젖꼭지_길이','목뒤_젖꼭지_길이','목뒤_젖꼭지_허리_둘레선_길이',
'목옆_젖꼭지_허리_둘레선_길이',
'어깨_길이','벽면_어깨_수평_길이','위팔_둘레_팔굽힌','위팔_사이_너비',
'손목_둘레', '팔꿈치_높이_팔굽힌','팔꿈치_둘레_팔굽힌','팔꿈치_사이_너비_팔굽힌',
'겨드랑_앞벽_사이_길이','겨드랑_앞접힘_사이_길이','겨드랑_뒤벽_사이_길이',
'겨드랑_뒤접힘_사이_길이','겨드랑_높이','겨드랑_둘레','겨드랑_두께',
'가슴_둘레','가슴_너비','가슴_두께','가슴_두께_벽면','젖_가슴_둘레',
'젖_가슴_너비','젖_가슴_두께','젖꼭지_사이_수평_길이','젖_가슴_아래_둘레',
'허리_둘레','허리_너비','허리_두께','배꼽수준_허리_둘레','배꼽수준_허리_너비',
'배꼽수준_허리_두께','허리_기준선_둘레','배꼽수준_앞중심_길이','배꼽수준_등_길이',
'배꼽수준_샅앞뒤_길이','배_둘레','앉은_배_두께','앉은_엉덩이배_두께',
'몸통_수직_길이','엉덩이_높이','엉덩이_둘레','배돌출점기준_엉덩이_둘레',
'엉덩이_너비','엉덩이_두께','엉덩이_수직_길이','엉덩이_옆_길이',
'앉은_엉덩이_너비','넙다리_직선_길이','넙다리_둘레','넙다리_중간_둘레','무릎_둘레',
'유방_볼륨_스누','유방_볼륨_논문','가슴_높이_신규','컵_기준치_신규']]
print(data.info())

## 데이터 결측치 삭제
data = data.dropna(axis=0)
print(data.info())

# BMI 컬럼 추가 : 소수점 첫째자리 반올림
data['BMI']=0
for i in tqdm.tqdm(range(0, len(data))):
    data['BMI'].iloc[i] = data['몸무게'].iloc[i]/((data['신장'].iloc[i]/1000)**2)
data['BMI']= round(data['BMI'], 1)

# 컬럼 소수점 첫째자리 반올림
data['유방_볼륨_스누']= round(data['유방_볼륨_스누'], 1)
data['유방_볼륨_논문']= round(data['유방_볼륨_논문'], 1)
print(data.head())
print(data.columns)

# 일부컬럼 정수형 변환
int_columns = ['목_둘레','목밑_둘레','목밑뒤_길이','목옆_젖꼭지_길이',
'목옆_젖꼭지_허리_둘레선_길이','위팔_둘레_팔굽힌','손목_둘레',
'팔꿈치_높이_팔굽힌','팔꿈치_둘레_팔굽힌','겨드랑_높이','겨드랑_둘레','겨드랑_두께',
'가슴_둘레','가슴_너비','가슴_두께','젖_가슴_둘레','젖_가슴_아래_둘레',
'허리_둘레','허리_너비','허리_두께','배꼽수준_허리_둘레',
'허리_기준선_둘레','엉덩이_둘레','넙다리_둘레']
for i in tqdm.tqdm(range(0, len(int_columns))):
    data[int_columns[i]] = data[int_columns[i]].astype('int64')

# CLO 예측 진행 : 'predict' 컬럼 생성
X = data[['나이', '측정복_젖_가슴_둘레',
'측정복_배꼽수준_허리_둘레', '키', '몸무게',
'목_둘레', '목밑_둘레', '목밑뒤_길이', '목뒤_등뼈위_겨드랑_수준_길이',
'목옆_젖꼭지_길이','목뒤_젖꼭지_길이','목뒤_젖꼭지_허리_둘레선_길이',
'목옆_젖꼭지_허리_둘레선_길이',
'어깨_길이','벽면_어깨_수평_길이','위팔_둘레_팔굽힌','위팔_사이_너비',
'손목_둘레', '팔꿈치_높이_팔굽힌','팔꿈치_둘레_팔굽힌','팔꿈치_사이_너비_팔굽힌',
'겨드랑_앞벽_사이_길이','겨드랑_앞접힘_사이_길이','겨드랑_뒤벽_사이_길이',
'겨드랑_뒤접힘_사이_길이','겨드랑_높이','겨드랑_둘레','겨드랑_두께',
'가슴_둘레','가슴_너비','가슴_두께','가슴_두께_벽면','젖_가슴_둘레',
'젖_가슴_너비','젖_가슴_두께','젖꼭지_사이_수평_길이','젖_가슴_아래_둘레',
'허리_둘레','허리_너비','허리_두께','배꼽수준_허리_둘레','배꼽수준_허리_너비',
'배꼽수준_허리_두께','허리_기준선_둘레','배꼽수준_앞중심_길이','배꼽수준_등_길이',
'배꼽수준_샅앞뒤_길이','배_둘레','앉은_배_두께','앉은_엉덩이배_두께',
'몸통_수직_길이','엉덩이_높이','엉덩이_둘레','배돌출점기준_엉덩이_둘레',
'엉덩이_너비','엉덩이_두께','엉덩이_수직_길이','엉덩이_옆_길이',
'앉은_엉덩이_너비','넙다리_직선_길이','넙다리_둘레','넙다리_중간_둘레','무릎_둘레',
'유방_볼륨_스누','유방_볼륨_논문','가슴_높이_신규','컵_기준치_신규']]
for col in data.columns.tolist():
    data[col] = pd.DataFrame(data[col])
# data["predict"] = pd.DataFrame(data=rf_run.predict(X), index=data.index)
data.to_excel('data/size_korea_anti/clo_predict_rf_reg_5column.xlsx',index=False)
