import numpy as np
import pandas as pd
import os
import sys
import tqdm

# sizekorea 8차 직접측정 데이터 불러오기
data = pd.read_excel('data/size_korea_new/size_korea_20_21_1.xlsx')
data.info()

# 컬럼 순서 변경 : 기본 신체 정보 -> 목 ~ 배 ~ 다리 순
data = data[['HUMAN_ID', '성별', '조사년도', '조사일', '나이', '측정복_젖_가슴_둘레',
'측정복_상의_사이즈', '측정복_배꼽수준_허리_둘레', '키', '몸무게',
'목_둘레', '목밑_둘레', '목밑뒤_길이', '목뒤_등뼈위_겨드랑_수준_길이',
'목옆_젖꼭지_길이','목뒤_젖꼭지_길이','목뒤_젖꼭지_허리_둘레선_길이',
'어깨_길이','벽면_어깨_수평_길이','위팔_둘레_팔굽힌','위팔_사이_너비',
'손목_둘레', '팔꿈치_높이_팔굽힌','팔꿈치_둘레_팔굽힌','팔꿈치_사이_너비_팔굽힌',
'겨드랑_앞벽_사이_길이','겨드랑_앞접힘_사이_길이','겨드랑_뒤벽_사이_길이',
'겨드랑_뒤접힘_사이_길이','겨드랑_높이','겨드랑_둘레','겨드랑_두께',
'가슴_둘레','가슴_너비','가슴_두께','가슴_두께_벽면','젖_가슴_둘레',
'젖_가슴_너비','젖_가슴_두께','젖꼭지_사이_수평_길이','젖_가슴_아래_둘레',
'허리_둘레','허리_너비','허리_두께','배꼽수준_허리_둘레','배꼽수준_허리_너비',
'배꼽수준_허리_두께','허리_기준선_둘레','배꼽수준_앞중심_길이','배꼽수준_등_길이',
'배꼽수준_샅앞뒤_길이','배_둘레','앉은_배_두께','앉은_엉덩이배_두께',
'몸통_수직_길이','엉덩이_높이','엉덩이_둘레','배돌출점기준_엉덩이_둘레',
'엉덩이_너비','엉덩이_두께','엉덩이_수직_길이','엉덩이_옆_길이',
'앉은_엉덩이_너비','넙다리_직선_길이','넙다리_둘레','넙다리_중간_둘레','무릎_둘레']]

data.info()

# sizekorea 목옆허리둘레 데이터 불러오기
plus_column = pd.read_excel('data/size_korea_new/size_korea_1_목옆허리둘레.xlsx')
plus_column.info()

merge_outer = pd.merge(data,plus_column, how='inner',on='HUMAN_ID')
merge_outer.info()
merge_outer = merge_outer[['HUMAN_ID', '성별', '조사년도', '조사일', '나이', '측정복_젖_가슴_둘레',
'측정복_상의_사이즈', '측정복_배꼽수준_허리_둘레', '키', '몸무게',
'목_둘레', '목밑_둘레', '목밑뒤_길이', '목뒤_등뼈위_겨드랑_수준_길이',
'목옆_젖꼭지_길이','목뒤_젖꼭지_길이','목뒤_젖꼭지_허리_둘레선_길이',
'목옆_젖꼭지_허리_둘레선_길이',
'어깨_길이','벽면_어깨_수평_길이','위팔_둘레_팔굽힌','위팔_사이_너비',
'손목_둘레', '팔꿈치_높이_팔굽힌','팔꿈치_둘레_팔굽힌','팔꿈치_사이_너비_팔굽힌',
'겨드랑_앞벽_사이_길이','겨드랑_앞접힘_사이_길이','겨드랑_뒤벽_사이_길이',
'겨드랑_뒤접힘_사이_길이','겨드랑_높이','겨드랑_둘레','겨드랑_두께',
'가슴_둘레','가슴_너비','가슴_두께','가슴_두께_벽면','젖_가슴_둘레',
'젖_가슴_너비','젖_가슴_두께','젖꼭지_사이_수평_길이','젖_가슴_아래_둘레',
'허리_둘레','허리_너비','허리_두께','배꼽수준_허리_둘레','배꼽수준_허리_너비',
'배꼽수준_허리_두께','허리_기준선_둘레','배꼽수준_앞중심_길이','배꼽수준_등_길이',
'배꼽수준_샅앞뒤_길이','배_둘레','앉은_배_두께','앉은_엉덩이배_두께',
'몸통_수직_길이','엉덩이_높이','엉덩이_둘레','배돌출점기준_엉덩이_둘레',
'엉덩이_너비','엉덩이_두께','엉덩이_수직_길이','엉덩이_옆_길이',
'앉은_엉덩이_너비','넙다리_직선_길이','넙다리_둘레','넙다리_중간_둘레','무릎_둘레']]

# 컬럼 변경 파일 저장 : 최종 사이즈코리아 데이터 셋
merge_outer.to_excel('data/size_korea_new/size_korea_01.xlsx',index=False)